Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief E004, CPUx Code Protection Execute Enable Register Set 1 */
#define CPU2_CPXE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E004u)

/** \brief E008, CPUx Code Protection Execute Enable Register Set 2 */
#define CPU2_CPXE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E008u)

/** \brief E00C, CPUx Code Protection Execute Enable Register Set 3 */
#define CPU2_CPXE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E00Cu)

/** \brief E010, CPUx Data Protection Read Enable Register Set 0 */
#define CPU2_DPRE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E010u)

/** \brief E014, CPUx Data Protection Read Enable Register Set 1 */
#define CPU2_DPRE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E014u)

/** \brief E018, CPUx Data Protection Read Enable Register Set 2 */
#define CPU2_DPRE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E018u)

/** \brief E01C, CPUx Data Protection Read Enable Register Set 3 */
#define CPU2_DPRE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E01Cu)

/** \brief E020, CPUx Data Protection Write Enable Register Set 0 */
#define CPU2_DPWE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E020u)

/** \brief E024, CPUx Data Protection Write Enable Register Set 1 */
#define CPU2_DPWE_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E024u)

/** \brief E028, CPUx Data Protection Write Enable Register Set 2 */
#define CPU2_DPWE_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E028u)

/** \brief E02C, CPUx Data Protection Write Enable Register Set 3 */
#define CPU2_DPWE_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E02Cu)

/** \brief E040, CPUx Code Protection Execute Enable Register Set 4 */
#define CPU2_CPXE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E040u)

/** \brief E044, CPUx Code Protection Execute Enable Register Set 5 */
#define CPU2_CPXE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E044u)

/** \brief E050, CPUx Data Protection Read Enable Register Set 4 */
#define CPU2_DPRE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E050u)

/** \brief E054, CPUx Data Protection Read Enable Register Set 5 */
#define CPU2_DPRE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E054u)

/** \brief E060, CPUx Data Protection Write Enable Register Set 4 */
#define CPU2_DPWE_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E060u)

/** \brief E064, CPUx Data Protection Write Enable Register Set 5 */
#define CPU2_DPWE_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E064u)

/** \brief E400, CPUx Temporal Protection System Control Register */
#define CPU2_TPS_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_CON*)0xF885E400u)

/** \brief E404, CPUx Temporal Protection System Timer Register 0 */
#define CPU2_TPS_TIMER0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E404u)

/** \brief E408, CPUx Temporal Protection System Timer Register 1 */
#define CPU2_TPS_TIMER1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E408u)

/** \brief E40C, CPUx Temporal Protection System Timer Register 2 */
#define CPU2_TPS_TIMER2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E40Cu)

/** \brief E440, CPUx Exception Entry Timer Load Value */
#define CPU2_TPS_EXTIM_ENTRY_LVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_ENTRY_LVAL*)0xF885E440u)

/** \brief E444, CPUx Exception Entry Timer Current Value */
#define CPU2_TPS_EXTIM_ENTRY_CVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_ENTRY_CVAL*)0xF885E444u)

/** \brief E448, CPUx Exception Exit  Timer Load Value */
#define CPU2_TPS_EXTIM_EXIT_LVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_EXIT_LVAL*)0xF885E448u)

/** \brief E44C, CPUx Exception Exit Timer Current Value */
#define CPU2_TPS_EXTIM_EXIT_CVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_EXIT_CVAL*)0xF885E44Cu)

/** \brief E450, CPUx Exception Timer Class Enable Register */
#define CPU2_TPS_EXTIM_CLASS_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_CLASS_EN*)0xF885E450u)

/** \brief E454, CPUx Exception Timer Status Register */
#define CPU2_TPS_EXTIM_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_STAT*)0xF885E454u)

/** \brief E458, CPUx Exception Timer FCX Register */
#define CPU2_TPS_EXTIM_FCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TPS_EXTIM_FCX*)0xF885E458u)

/** \brief F000, CPUx Trigger Event 0 */
#define CPU2_TR0_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F000u)
/** Alias (User Manual Name) for CPU2_TR0_EVT.
* To use register names with standard convension, please use CPU2_TR0_EVT.
*/
#define CPU2_TR0EVT (CPU2_TR0_EVT)

/** \brief F004, CPUx Trigger Address 0 */
#define CPU2_TR0_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F004u)
/** Alias (User Manual Name) for CPU2_TR0_ADR.
* To use register names with standard convension, please use CPU2_TR0_ADR.
*/
#define CPU2_TR0ADR (CPU2_TR0_ADR)

/** \brief F008, CPUx Trigger Event 1 */
#define CPU2_TR1_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F008u)
/** Alias (User Manual Name) for CPU2_TR1_EVT.
* To use register names with standard convension, please use CPU2_TR1_EVT.
*/
#define CPU2_TR1EVT (CPU2_TR1_EVT)

/** \brief F00C, CPUx Trigger Address 1 */
#define CPU2_TR1_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F00Cu)
/** Alias (User Manual Name) for CPU2_TR1_ADR.
* To use register names with standard convension, please use CPU2_TR1_ADR.
*/
#define CPU2_TR1ADR (CPU2_TR1_ADR)

/** \brief F010, CPUx Trigger Event 2 */
#define CPU2_TR2_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F010u)
/** Alias (User Manual Name) for CPU2_TR2_EVT.
* To use register names with standard convension, please use CPU2_TR2_EVT.
*/
#define CPU2_TR2EVT (CPU2_TR2_EVT)

/** \brief F014, CPUx Trigger Address 2 */
#define CPU2_TR2_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F014u)
/** Alias (User Manual Name) for CPU2_TR2_ADR.
* To use register names with standard convension, please use CPU2_TR2_ADR.
*/
#define CPU2_TR2ADR (CPU2_TR2_ADR)

