Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief FC8C, CPUx Overlay Mask Register 31 */
#define CPU3_BLK31_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF886FC8Cu)
/** Alias (User Manual Name) for CPU3_BLK31_OMASK.
* To use register names with standard convension, please use CPU3_BLK31_OMASK.
*/
#define CPU3_OMASK31 (CPU3_BLK31_OMASK)

/** \brief 1030, CPUx SRI Error Generation Register */
#define CPU3_SEGEN /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SEGEN*)0xF8871030u)

/** \brief 8004, CPUx Task Address Space Identifier Register */
#define CPU3_TASK_ASI /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TASK_ASI*)0xF8878004u)

/** \brief 8100, CPUx Data Access CacheabilityRegister */
#define CPU3_PMA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA0*)0xF8878100u)

/** \brief 8104, CPUx Code Access CacheabilityRegister */
#define CPU3_PMA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA1*)0xF8878104u)

/** \brief 8108, CPUx  Peripheral Space Identifier register */
#define CPU3_PMA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA2*)0xF8878108u)

/** \brief 9000, CPUx Data Control Register 2 */
#define CPU3_DCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCON2*)0xF8879000u)

/** \brief 900C, CPUx SIST Mode Access Control Register */
#define CPU3_SMACON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SMACON*)0xF887900Cu)

/** \brief 9010, CPUx Data Synchronous Trap Register */
#define CPU3_DSTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DSTR*)0xF8879010u)

/** \brief 9018, CPUx Data Asynchronous Trap Register */
#define CPU3_DATR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DATR*)0xF8879018u)

/** \brief 901C, CPUx Data Error Address Register */
#define CPU3_DEADD /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DEADD*)0xF887901Cu)

/** \brief 9020, CPUx Data Integrity Error Address Register */
#define CPU3_DIEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8879020u)

/** \brief 9024, CPUx Data Integrity Error Trap Register */
#define CPU3_DIETR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DIETR*)0xF8879024u)

/** \brief 9040, CPUx Data Memory Control Register */
#define CPU3_DCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCON0*)0xF8879040u)

/** \brief 9200, CPUx Program Synchronous Trap Register */
#define CPU3_PSTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PSTR*)0xF8879200u)

/** \brief 9204, CPUx Program Control 1 */
#define CPU3_PCON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON1*)0xF8879204u)

/** \brief 9208, CPUx Program Control 2 */
#define CPU3_PCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON2*)0xF8879208u)

/** \brief 920C, CPUx Program Control 0 */
#define CPU3_PCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON0*)0xF887920Cu)

/** \brief 9210, CPUx Program Integrity Error Address Register */
#define CPU3_PIEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PIEAR*)0xF8879210u)

/** \brief 9214, CPUx Program Integrity Error Trap Register */
#define CPU3_PIETR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PIETR*)0xF8879214u)

/** \brief 9400, CPUx Compatibility Control Register */
#define CPU3_COMPAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8879400u)

/** \brief A000, CPUx Trap Control Register */
#define CPU3_FPU_TRAP_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF887A000u)

/** \brief A004, CPUx Trapping Instruction Program Counter Register */
#define CPU3_FPU_TRAP_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF887A004u)

/** \brief A008, CPUx Trapping Instruction Opcode Register */
#define CPU3_FPU_TRAP_OPC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF887A008u)

/** \brief A010, CPUx Trapping Instruction Operand Register */
#define CPU3_FPU_TRAP_SRC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF887A010u)

/** \brief A014, CPUx Trapping Instruction Operand Register */
#define CPU3_FPU_TRAP_SRC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF887A014u)

/** \brief A018, CPUx Trapping Instruction Operand Register */
#define CPU3_FPU_TRAP_SRC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF887A018u)

/** \brief C000, CPUx Data Protection Range 0, Lower Bound Register */
#define CPU3_DPR0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C000u)

/** \brief C004, CPUx Data Protection Range 0, Upper Bound Register */
#define CPU3_DPR0_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C004u)

/** \brief C008, CPUx Data Protection Range 1, Lower Bound Register */
#define CPU3_DPR1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C008u)

/** \brief C00C, CPUx Data Protection Range 1, Upper Bound Register */
#define CPU3_DPR1_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C00Cu)

/** \brief C010, CPUx Data Protection Range 2, Lower Bound Register */
#define CPU3_DPR2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C010u)

/** \brief C014, CPUx Data Protection Range 2, Upper Bound Register */
#define CPU3_DPR2_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C014u)

/** \brief C018, CPUx Data Protection Range 3, Lower Bound Register */
#define CPU3_DPR3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C018u)

/** \brief C01C, CPUx Data Protection Range 3, Upper Bound Register */
#define CPU3_DPR3_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C01Cu)

/** \brief C020, CPUx Data Protection Range 4, Lower Bound Register */
#define CPU3_DPR4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C020u)

/** \brief C024, CPUx Data Protection Range 4, Upper Bound Register */
#define CPU3_DPR4_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C024u)

/** \brief C028, CPUx Data Protection Range 5, Lower Bound Register */
#define CPU3_DPR5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C028u)

/** \brief C02C, CPUx Data Protection Range 5, Upper Bound Register */
#define CPU3_DPR5_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C02Cu)

/** \brief C030, CPUx Data Protection Range 6, Lower Bound Register */
#define CPU3_DPR6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C030u)

/** \brief C034, CPUx Data Protection Range 6, Upper Bound Register */
#define CPU3_DPR6_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C034u)

/** \brief C038, CPUx Data Protection Range 7, Lower Bound Register */
#define CPU3_DPR7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C038u)

/** \brief C03C, CPUx Data Protection Range 7, Upper Bound Register */
#define CPU3_DPR7_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C03Cu)

