Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief C040, CPUx Data Protection Range 8, Lower Bound Register */
#define CPU3_DPR8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C040u)

/** \brief C044, CPUx Data Protection Range 8, Upper Bound Register */
#define CPU3_DPR8_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C044u)

/** \brief C048, CPUx Data Protection Range 9, Lower Bound Register */
#define CPU3_DPR9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C048u)

/** \brief C04C, CPUx Data Protection Range 9, Upper Bound Register */
#define CPU3_DPR9_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C04Cu)

/** \brief C050, CPUx Data Protection Range 10, Lower Bound Register */
#define CPU3_DPR10_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C050u)

/** \brief C054, CPUx Data Protection Range 10, Upper Bound Register */
#define CPU3_DPR10_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C054u)

/** \brief C058, CPUx Data Protection Range 11, Lower Bound Register */
#define CPU3_DPR11_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C058u)

/** \brief C05C, CPUx Data Protection Range 11, Upper Bound Register */
#define CPU3_DPR11_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C05Cu)

/** \brief C060, CPUx Data Protection Range 12, Lower Bound Register */
#define CPU3_DPR12_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C060u)

/** \brief C064, CPUx Data Protection Range 12, Upper Bound Register */
#define CPU3_DPR12_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C064u)

/** \brief C068, CPUx Data Protection Range 13, Lower Bound Register */
#define CPU3_DPR13_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C068u)

/** \brief C06C, CPUx Data Protection Range 13, Upper Bound Register */
#define CPU3_DPR13_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C06Cu)

/** \brief C070, CPUx Data Protection Range 14, Lower Bound Register */
#define CPU3_DPR14_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C070u)

/** \brief C074, CPUx Data Protection Range 14, Upper Bound Register */
#define CPU3_DPR14_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C074u)

/** \brief C078, CPUx Data Protection Range 15, Lower Bound Register */
#define CPU3_DPR15_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C078u)

/** \brief C07C, CPUx Data Protection Range 15, Upper Bound Register */
#define CPU3_DPR15_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C07Cu)

/** \brief C080, CPUx Data Protection Range 16, Lower Bound Register */
#define CPU3_DPR16_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C080u)

/** \brief C084, CPUx Data Protection Range 16, Upper Bound Register */
#define CPU3_DPR16_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C084u)

/** \brief C088, CPUx Data Protection Range 17, Lower Bound Register */
#define CPU3_DPR17_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF887C088u)

/** \brief C08C, CPUx Data Protection Range 17, Upper Bound Register */
#define CPU3_DPR17_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF887C08Cu)

/** \brief D000, CPUx Code Protection Range 0 Lower Bound Register */
#define CPU3_CPR0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D000u)

/** \brief D004, CPUx Code Protection Range 0 Upper Bound Register */
#define CPU3_CPR0_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D004u)

/** \brief D008, CPUx Code Protection Range 1 Lower Bound Register */
#define CPU3_CPR1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D008u)

/** \brief D00C, CPUx Code Protection Range 1 Upper Bound Register */
#define CPU3_CPR1_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D00Cu)

/** \brief D010, CPUx Code Protection Range 2 Lower Bound Register */
#define CPU3_CPR2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D010u)

/** \brief D014, CPUx Code Protection Range 2 Upper Bound Register */
#define CPU3_CPR2_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D014u)

/** \brief D018, CPUx Code Protection Range 3 Lower Bound Register */
#define CPU3_CPR3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D018u)

/** \brief D01C, CPUx Code Protection Range 3 Upper Bound Register */
#define CPU3_CPR3_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D01Cu)

/** \brief D020, CPUx Code Protection Range 4 Lower Bound Register */
#define CPU3_CPR4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D020u)

/** \brief D024, CPUx Code Protection Range 4 Upper Bound Register */
#define CPU3_CPR4_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D024u)

/** \brief D028, CPUx Code Protection Range 5 Lower Bound Register */
#define CPU3_CPR5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D028u)

/** \brief D02C, CPUx Code Protection Range 5 Upper Bound Register */
#define CPU3_CPR5_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D02Cu)

/** \brief D030, CPUx Code Protection Range 6 Lower Bound Register */
#define CPU3_CPR6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D030u)

/** \brief D034, CPUx Code Protection Range 6 Upper Bound Register */
#define CPU3_CPR6_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D034u)

/** \brief D038, CPUx Code Protection Range 7 Lower Bound Register */
#define CPU3_CPR7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D038u)

/** \brief D03C, CPUx Code Protection Range 7 Upper Bound Register */
#define CPU3_CPR7_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D03Cu)

/** \brief D040, CPUx Code Protection Range 8 Lower Bound Register */
#define CPU3_CPR8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D040u)

/** \brief D044, CPUx Code Protection Range 8 Upper Bound Register */
#define CPU3_CPR8_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D044u)

/** \brief D048, CPUx Code Protection Range 9 Lower Bound Register */
#define CPU3_CPR9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D048u)

/** \brief D04C, CPUx Code Protection Range 9 Upper Bound Register */
#define CPU3_CPR9_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D04Cu)

/** \brief E000, CPUx Code Protection Execute Enable Register Set 0 */
#define CPU3_CPXE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF887E000u)

