Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief E0E8, CPUx Safety Protection Region SPR Read Access Enable Register A6 */
#define CPU4_SPR_SPROT_RGNACCENA_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF888E0E8u)
/** Alias (User Manual Name) for CPU4_SPR_SPROT_RGNACCENA_R6.
* To use register names with standard convension, please use CPU4_SPR_SPROT_RGNACCENA_R6.
*/
#define CPU4_SPR_SPROT_RGNACCENA6_R (CPU4_SPR_SPROT_RGNACCENA_R6)

/** \brief E0EC, CPUx Safety Protection Region SPR Read Access Enable Register B6 */
#define CPU4_SPR_SPROT_RGNACCENB_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF888E0ECu)
/** Alias (User Manual Name) for CPU4_SPR_SPROT_RGNACCENB_R6.
* To use register names with standard convension, please use CPU4_SPR_SPROT_RGNACCENB_R6.
*/
#define CPU4_SPR_SPROT_RGNACCENB6_R (CPU4_SPR_SPROT_RGNACCENB_R6)

/** \brief E0F8, CPUx Safety Protection Region SPR Read Access Enable Register A7 */
#define CPU4_SPR_SPROT_RGNACCENA_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF888E0F8u)
/** Alias (User Manual Name) for CPU4_SPR_SPROT_RGNACCENA_R7.
* To use register names with standard convension, please use CPU4_SPR_SPROT_RGNACCENA_R7.
*/
#define CPU4_SPR_SPROT_RGNACCENA7_R (CPU4_SPR_SPROT_RGNACCENA_R7)

/** \brief E0FC, CPUx Safety Protection Region SPR Read Access Enable Register B7 */
#define CPU4_SPR_SPROT_RGNACCENB_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF888E0FCu)
/** Alias (User Manual Name) for CPU4_SPR_SPROT_RGNACCENB_R7.
* To use register names with standard convension, please use CPU4_SPR_SPROT_RGNACCENB_R7.
*/
#define CPU4_SPR_SPROT_RGNACCENB7_R (CPU4_SPR_SPROT_RGNACCENB_R7)

/** \brief E100, CPUx  Safety Protection Register Access Enable Register A */
#define CPU4_SFR_SPROT_ACCENA_W /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENA_W*)0xF888E100u)

/** \brief E104, CPUx  Safety Protection Region Access Enable Register B */
#define CPU4_SFR_SPROT_ACCENB_W /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENB_W*)0xF888E104u)

/** \brief E110, CPUx  Safety Protection Region LPB Read Access Enable Register A */
#define CPU4_LPB_SPROT_ACCENA_R /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENA_R*)0xF888E110u)

/** \brief E114, CPUx Safety Protection Region LPB Read Access Enable Register B */
#define CPU4_LPB_SPROT_ACCENB_R /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENB_R*)0xF888E114u)

/** \brief E200, CPUx  Safety Protection DLMU Region Lower Address Register 0 */
#define CPU4_DLMU_SPROT_RGNLA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF888E200u)

/** \brief E204, CPUx  Safety protection DLMU Region Upper Address Register 0 */
#define CPU4_DLMU_SPROT_RGNUA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF888E204u)

/** \brief E208, CPUx  Safety Protection Region DLMU Write Access Enable Register A0 */
#define CPU4_DLMU_SPROT_RGNACCENA_W0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF888E208u)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENA_W0.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENA_W0.
*/
#define CPU4_DLMU_SPROT_RGNACCENA0_W (CPU4_DLMU_SPROT_RGNACCENA_W0)

/** \brief E20C, CPUx  Safety Protection Region DLMU Write Access Enable Register B0 */
#define CPU4_DLMU_SPROT_RGNACCENB_W0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF888E20Cu)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENB_W0.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENB_W0.
*/
#define CPU4_DLMU_SPROT_RGNACCENB0_W (CPU4_DLMU_SPROT_RGNACCENB_W0)

/** \brief E210, CPUx  Safety Protection DLMU Region Lower Address Register 1 */
#define CPU4_DLMU_SPROT_RGNLA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF888E210u)

/** \brief E214, CPUx  Safety protection DLMU Region Upper Address Register 1 */
#define CPU4_DLMU_SPROT_RGNUA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF888E214u)

/** \brief E218, CPUx  Safety Protection Region DLMU Write Access Enable Register A1 */
#define CPU4_DLMU_SPROT_RGNACCENA_W1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF888E218u)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENA_W1.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENA_W1.
*/
#define CPU4_DLMU_SPROT_RGNACCENA1_W (CPU4_DLMU_SPROT_RGNACCENA_W1)

/** \brief E21C, CPUx  Safety Protection Region DLMU Write Access Enable Register B1 */
#define CPU4_DLMU_SPROT_RGNACCENB_W1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF888E21Cu)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENB_W1.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENB_W1.
*/
#define CPU4_DLMU_SPROT_RGNACCENB1_W (CPU4_DLMU_SPROT_RGNACCENB_W1)

/** \brief E220, CPUx  Safety Protection DLMU Region Lower Address Register 2 */
#define CPU4_DLMU_SPROT_RGNLA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNLA*)0xF888E220u)

/** \brief E224, CPUx  Safety protection DLMU Region Upper Address Register 2 */
#define CPU4_DLMU_SPROT_RGNUA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNUA*)0xF888E224u)

/** \brief E228, CPUx  Safety Protection Region DLMU Write Access Enable Register A2 */
#define CPU4_DLMU_SPROT_RGNACCENA_W2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA_W*)0xF888E228u)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENA_W2.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENA_W2.
*/
#define CPU4_DLMU_SPROT_RGNACCENA2_W (CPU4_DLMU_SPROT_RGNACCENA_W2)

/** \brief E22C, CPUx  Safety Protection Region DLMU Write Access Enable Register B2 */
#define CPU4_DLMU_SPROT_RGNACCENB_W2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB_W*)0xF888E22Cu)
/** Alias (User Manual Name) for CPU4_DLMU_SPROT_RGNACCENB_W2.
* To use register names with standard convension, please use CPU4_DLMU_SPROT_RGNACCENB_W2.
*/
#define CPU4_DLMU_SPROT_RGNACCENB2_W (CPU4_DLMU_SPROT_RGNACCENB_W2)

