Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief FC8C, CPUx Overlay Mask Register 31 */
#define CPU4_BLK31_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF888FC8Cu)
/** Alias (User Manual Name) for CPU4_BLK31_OMASK.
* To use register names with standard convension, please use CPU4_BLK31_OMASK.
*/
#define CPU4_OMASK31 (CPU4_BLK31_OMASK)

/** \brief 1030, CPUx SRI Error Generation Register */
#define CPU4_SEGEN /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SEGEN*)0xF8891030u)

/** \brief 8004, CPUx Task Address Space Identifier Register */
#define CPU4_TASK_ASI /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TASK_ASI*)0xF8898004u)

/** \brief 8100, CPUx Data Access CacheabilityRegister */
#define CPU4_PMA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA0*)0xF8898100u)

/** \brief 8104, CPUx Code Access CacheabilityRegister */
#define CPU4_PMA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA1*)0xF8898104u)

/** \brief 8108, CPUx  Peripheral Space Identifier register */
#define CPU4_PMA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA2*)0xF8898108u)

/** \brief 9000, CPUx Data Control Register 2 */
#define CPU4_DCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCON2*)0xF8899000u)

/** \brief 900C, CPUx SIST Mode Access Control Register */
#define CPU4_SMACON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SMACON*)0xF889900Cu)

/** \brief 9010, CPUx Data Synchronous Trap Register */
#define CPU4_DSTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DSTR*)0xF8899010u)

/** \brief 9018, CPUx Data Asynchronous Trap Register */
#define CPU4_DATR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DATR*)0xF8899018u)

/** \brief 901C, CPUx Data Error Address Register */
#define CPU4_DEADD /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DEADD*)0xF889901Cu)

/** \brief 9020, CPUx Data Integrity Error Address Register */
#define CPU4_DIEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8899020u)

/** \brief 9024, CPUx Data Integrity Error Trap Register */
#define CPU4_DIETR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DIETR*)0xF8899024u)

/** \brief 9040, CPUx Data Memory Control Register */
#define CPU4_DCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCON0*)0xF8899040u)

/** \brief 9200, CPUx Program Synchronous Trap Register */
#define CPU4_PSTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PSTR*)0xF8899200u)

/** \brief 9204, CPUx Program Control 1 */
#define CPU4_PCON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON1*)0xF8899204u)

/** \brief 9208, CPUx Program Control 2 */
#define CPU4_PCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON2*)0xF8899208u)

/** \brief 920C, CPUx Program Control 0 */
#define CPU4_PCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON0*)0xF889920Cu)

/** \brief 9210, CPUx Program Integrity Error Address Register */
#define CPU4_PIEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PIEAR*)0xF8899210u)

/** \brief 9214, CPUx Program Integrity Error Trap Register */
#define CPU4_PIETR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PIETR*)0xF8899214u)

/** \brief 9400, CPUx Compatibility Control Register */
#define CPU4_COMPAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8899400u)

/** \brief A000, CPUx Trap Control Register */
#define CPU4_FPU_TRAP_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF889A000u)

/** \brief A004, CPUx Trapping Instruction Program Counter Register */
#define CPU4_FPU_TRAP_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF889A004u)

/** \brief A008, CPUx Trapping Instruction Opcode Register */
#define CPU4_FPU_TRAP_OPC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF889A008u)

/** \brief A010, CPUx Trapping Instruction Operand Register */
#define CPU4_FPU_TRAP_SRC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF889A010u)

/** \brief A014, CPUx Trapping Instruction Operand Register */
#define CPU4_FPU_TRAP_SRC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF889A014u)

/** \brief A018, CPUx Trapping Instruction Operand Register */
#define CPU4_FPU_TRAP_SRC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF889A018u)

/** \brief C000, CPUx Data Protection Range 0, Lower Bound Register */
#define CPU4_DPR0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF889C000u)

/** \brief C004, CPUx Data Protection Range 0, Upper Bound Register */
#define CPU4_DPR0_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF889C004u)

/** \brief C008, CPUx Data Protection Range 1, Lower Bound Register */
#define CPU4_DPR1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF889C008u)

/** \brief C00C, CPUx Data Protection Range 1, Upper Bound Register */
#define CPU4_DPR1_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF889C00Cu)

/** \brief C010, CPUx Data Protection Range 2, Lower Bound Register */
#define CPU4_DPR2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF889C010u)

/** \brief C014, CPUx Data Protection Range 2, Upper Bound Register */
#define CPU4_DPR2_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF889C014u)

/** \brief C018, CPUx Data Protection Range 3, Lower Bound Register */
#define CPU4_DPR3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF889C018u)

/** \brief C01C, CPUx Data Protection Range 3, Upper Bound Register */
#define CPU4_DPR3_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF889C01Cu)

/** \brief C020, CPUx Data Protection Range 4, Lower Bound Register */
#define CPU4_DPR4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF889C020u)

/** \brief C024, CPUx Data Protection Range 4, Upper Bound Register */
#define CPU4_DPR4_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF889C024u)

/** \brief C028, CPUx Data Protection Range 5, Lower Bound Register */
#define CPU4_DPR5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF889C028u)

/** \brief C02C, CPUx Data Protection Range 5, Upper Bound Register */
#define CPU4_DPR5_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF889C02Cu)

/** \brief C030, CPUx Data Protection Range 6, Lower Bound Register */
#define CPU4_DPR6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF889C030u)

/** \brief C034, CPUx Data Protection Range 6, Upper Bound Register */
#define CPU4_DPR6_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF889C034u)

/** \brief C038, CPUx Data Protection Range 7, Lower Bound Register */
#define CPU4_DPR7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF889C038u)

/** \brief C03C, CPUx Data Protection Range 7, Upper Bound Register */
#define CPU4_DPR7_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF889C03Cu)

