Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief F018, CPUx Trigger Event 3 */
#define CPU4_TR3_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF889F018u)
/** Alias (User Manual Name) for CPU4_TR3_EVT.
* To use register names with standard convension, please use CPU4_TR3_EVT.
*/
#define CPU4_TR3EVT (CPU4_TR3_EVT)

/** \brief F01C, CPUx Trigger Address 3 */
#define CPU4_TR3_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF889F01Cu)
/** Alias (User Manual Name) for CPU4_TR3_ADR.
* To use register names with standard convension, please use CPU4_TR3_ADR.
*/
#define CPU4_TR3ADR (CPU4_TR3_ADR)

/** \brief F020, CPUx Trigger Event 4 */
#define CPU4_TR4_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF889F020u)
/** Alias (User Manual Name) for CPU4_TR4_EVT.
* To use register names with standard convension, please use CPU4_TR4_EVT.
*/
#define CPU4_TR4EVT (CPU4_TR4_EVT)

/** \brief F024, CPUx Trigger Address 4 */
#define CPU4_TR4_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF889F024u)
/** Alias (User Manual Name) for CPU4_TR4_ADR.
* To use register names with standard convension, please use CPU4_TR4_ADR.
*/
#define CPU4_TR4ADR (CPU4_TR4_ADR)

/** \brief F028, CPUx Trigger Event 5 */
#define CPU4_TR5_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF889F028u)
/** Alias (User Manual Name) for CPU4_TR5_EVT.
* To use register names with standard convension, please use CPU4_TR5_EVT.
*/
#define CPU4_TR5EVT (CPU4_TR5_EVT)

/** \brief F02C, CPUx Trigger Address 5 */
#define CPU4_TR5_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF889F02Cu)
/** Alias (User Manual Name) for CPU4_TR5_ADR.
* To use register names with standard convension, please use CPU4_TR5_ADR.
*/
#define CPU4_TR5ADR (CPU4_TR5_ADR)

/** \brief F030, CPUx Trigger Event 6 */
#define CPU4_TR6_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF889F030u)
/** Alias (User Manual Name) for CPU4_TR6_EVT.
* To use register names with standard convension, please use CPU4_TR6_EVT.
*/
#define CPU4_TR6EVT (CPU4_TR6_EVT)

/** \brief F034, CPUx Trigger Address 6 */
#define CPU4_TR6_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF889F034u)
/** Alias (User Manual Name) for CPU4_TR6_ADR.
* To use register names with standard convension, please use CPU4_TR6_ADR.
*/
#define CPU4_TR6ADR (CPU4_TR6_ADR)

/** \brief F038, CPUx Trigger Event 7 */
#define CPU4_TR7_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF889F038u)
/** Alias (User Manual Name) for CPU4_TR7_EVT.
* To use register names with standard convension, please use CPU4_TR7_EVT.
*/
#define CPU4_TR7EVT (CPU4_TR7_EVT)

/** \brief F03C, CPUx Trigger Address 7 */
#define CPU4_TR7_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF889F03Cu)
/** Alias (User Manual Name) for CPU4_TR7_ADR.
* To use register names with standard convension, please use CPU4_TR7_ADR.
*/
#define CPU4_TR7ADR (CPU4_TR7_ADR)

/** \brief FC00, CPUx Counter Control */
#define CPU4_CCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CCTRL*)0xF889FC00u)

/** \brief FC04, CPUx CPU Clock Cycle Count */
#define CPU4_CCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CCNT*)0xF889FC04u)

/** \brief FC08, CPUx Instruction Count */
#define CPU4_ICNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ICNT*)0xF889FC08u)

/** \brief FC0C, CPUx Multi-Count Register 1 */
#define CPU4_M1CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M1CNT*)0xF889FC0Cu)

/** \brief FC10, CPUx Multi-Count Register 2 */
#define CPU4_M2CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M2CNT*)0xF889FC10u)

/** \brief FC14, CPUx Multi-Count Register 3 */
#define CPU4_M3CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M3CNT*)0xF889FC14u)

/** \brief FD00, CPUx Debug Status Register */
#define CPU4_DBGSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DBGSR*)0xF889FD00u)

/** \brief FD08, CPUx External Event Register */
#define CPU4_EXEVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_EXEVT*)0xF889FD08u)

/** \brief FD0C, CPUx Core Register Access Event */
#define CPU4_CREVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CREVT*)0xF889FD0Cu)

/** \brief FD10, CPUx Software Debug Event */
#define CPU4_SWEVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SWEVT*)0xF889FD10u)

/** \brief FD30, CPUx TriggerAddressx */
#define CPU4_TRIG_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF889FD30u)

/** \brief FD40, CPUx Debug Monitor Start Address */
#define CPU4_DMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DMS*)0xF889FD40u)

/** \brief FD44, CPUx Debug Context Save Area Pointer */
#define CPU4_DCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCX*)0xF889FD44u)

/** \brief FD48, CPUx Debug Trap Control Register */
#define CPU4_DBGTCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF889FD48u)

/** \brief FE00, CPUx Previous Context Information Register */
#define CPU4_PCXI /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCXI*)0xF889FE00u)

/** \brief FE04, CPUx Program Status Word */
#define CPU4_PSW /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PSW*)0xF889FE04u)

/** \brief FE08, CPUx Program Counter */
#define CPU4_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PC*)0xF889FE08u)

/** \brief FE14, CPUx System Configuration Register */
#define CPU4_SYSCON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SYSCON*)0xF889FE14u)

/** \brief FE18, CPUx Identification Register TC1.6.2P */
#define CPU4_CPU_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF889FE18u)

/** \brief FE1C, CPUx Core Identification Register */
#define CPU4_CORE_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF889FE1Cu)

/** \brief FE20, CPUx Base Interrupt Vector Table Pointer */
#define CPU4_BIV /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BIV*)0xF889FE20u)

/** \brief FE24, CPUx Base Trap Vector Table Pointer */
#define CPU4_BTV /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BTV*)0xF889FE24u)

/** \brief FE28, CPUx Interrupt Stack Pointer */
#define CPU4_ISP /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ISP*)0xF889FE28u)

/** \brief FE2C, CPUx Interrupt Control Register */
#define CPU4_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ICR*)0xF889FE2Cu)

/** \brief FE38, CPUx Free CSA List Head Pointer */
#define CPU4_FCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FCX*)0xF889FE38u)

/** \brief FE3C, CPUx Free CSA List Limit Pointer */
#define CPU4_LCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LCX*)0xF889FE3Cu)

/** \brief FE50, CPUx Customer ID register */
#define CPU4_CUS_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF889FE50u)

/** \brief FF00, CPUx Data General Purpose Register 0 */
#define CPU4_D0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF00u)

