Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief FF04, CPUx Data General Purpose Register 1 */
#define CPU4_D1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF04u)

/** \brief FF08, CPUx Data General Purpose Register 2 */
#define CPU4_D2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF08u)

/** \brief FF0C, CPUx Data General Purpose Register 3 */
#define CPU4_D3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF0Cu)

/** \brief FF10, CPUx Data General Purpose Register 4 */
#define CPU4_D4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF10u)

/** \brief FF14, CPUx Data General Purpose Register 5 */
#define CPU4_D5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF14u)

/** \brief FF18, CPUx Data General Purpose Register 6 */
#define CPU4_D6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF18u)

/** \brief FF1C, CPUx Data General Purpose Register 7 */
#define CPU4_D7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF1Cu)

/** \brief FF20, CPUx Data General Purpose Register 8 */
#define CPU4_D8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF20u)

/** \brief FF24, CPUx Data General Purpose Register 9 */
#define CPU4_D9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF24u)

/** \brief FF28, CPUx Data General Purpose Register 10 */
#define CPU4_D10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF28u)

/** \brief FF2C, CPUx Data General Purpose Register 11 */
#define CPU4_D11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF2Cu)

/** \brief FF30, CPUx Data General Purpose Register 12 */
#define CPU4_D12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF30u)

/** \brief FF34, CPUx Data General Purpose Register 13 */
#define CPU4_D13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF34u)

/** \brief FF38, CPUx Data General Purpose Register 14 */
#define CPU4_D14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF38u)

/** \brief FF3C, CPUx Data General Purpose Register 15 */
#define CPU4_D15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF889FF3Cu)

/** \brief FF80, CPUx Address General Purpose Register 0 */
#define CPU4_A0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FF80u)

/** \brief FF84, CPUx Address General Purpose Register 1 */
#define CPU4_A1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FF84u)

/** \brief FF88, CPUx Address General Purpose Register 2 */
#define CPU4_A2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FF88u)

/** \brief FF8C, CPUx Address General Purpose Register 3 */
#define CPU4_A3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FF8Cu)

/** \brief FF90, CPUx Address General Purpose Register 4 */
#define CPU4_A4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FF90u)

/** \brief FF94, CPUx Address General Purpose Register 5 */
#define CPU4_A5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FF94u)

/** \brief FF98, CPUx Address General Purpose Register 6 */
#define CPU4_A6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FF98u)

/** \brief FF9C, CPUx Address General Purpose Register 7 */
#define CPU4_A7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FF9Cu)

/** \brief FFA0, CPUx Address General Purpose Register 8 */
#define CPU4_A8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FFA0u)

/** \brief FFA4, CPUx Address General Purpose Register 9 */
#define CPU4_A9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FFA4u)

/** \brief FFA8, CPUx Address General Purpose Register 10 */
#define CPU4_A10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FFA8u)

/** \brief FFAC, CPUx Address General Purpose Register 11 */
#define CPU4_A11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FFACu)

/** \brief FFB0, CPUx Address General Purpose Register 12 */
#define CPU4_A12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FFB0u)

/** \brief FFB4, CPUx Address General Purpose Register 13 */
#define CPU4_A13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FFB4u)

/** \brief FFB8, CPUx Address General Purpose Register 14 */
#define CPU4_A14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FFB8u)

/** \brief FFBC, CPUx Address General Purpose Register 15 */
#define CPU4_A15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF889FFBCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cpu_Registers_Cfg_Cpu5
 * \{  */
/** \brief 1100, CPUx Flash Configuration Register 0 */
#define CPU5_FLASHCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON0*)0xF88C1100u)

/** \brief 1104, CPUx Flash Configuration Register 1 */
#define CPU5_FLASHCON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON1*)0xF88C1104u)

/** \brief 1108, CPUx Flash Configuration Register 2 */
#define CPU5_FLASHCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON2*)0xF88C1108u)

/** \brief 110C, CPUx Flash Configuration Register 3 */
#define CPU5_FLASHCON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON3*)0xF88C110Cu)

/** \brief 1110, CPUx Flash Configuration Register 4 */
#define CPU5_FLASHCON4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON4*)0xF88C1110u)

/** \brief D000, CPUx  Reset Register 0 */
#define CPU5_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRST0*)0xF88CD000u)

/** \brief D004, CPUx  Reset Register 1 */
#define CPU5_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRST1*)0xF88CD004u)

/** \brief D008, CPUx Reset Clear Register */
#define CPU5_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRSTCLR*)0xF88CD008u)

/** \brief E000, CPUx  Safety Protection SPR Region Lower Address Register 0 */
#define CPU5_RGN0_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF88CE000u)
/** Alias (User Manual Name) for CPU5_RGN0_LA.
* To use register names with standard convension, please use CPU5_RGN0_LA.
*/
#define CPU5_SPR_SPROT_RGNLA0 (CPU5_RGN0_LA)

/** \brief E004, CPUx  Safety protection SPR Region Upper Address Register 0 */
#define CPU5_RGN0_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF88CE004u)
/** Alias (User Manual Name) for CPU5_RGN0_UA.
* To use register names with standard convension, please use CPU5_RGN0_UA.
*/
#define CPU5_SPR_SPROT_RGNUA0 (CPU5_RGN0_UA)

