Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief FBD0, CPUx Redirected Address Base Register 16 */
#define CPU5_BLK16_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFBD0u)
/** Alias (User Manual Name) for CPU5_BLK16_RABR.
* To use register names with standard convension, please use CPU5_BLK16_RABR.
*/
#define CPU5_RABR16 (CPU5_BLK16_RABR)

/** \brief FBD4, CPUx Overlay Target Address Register 16 */
#define CPU5_BLK16_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFBD4u)
/** Alias (User Manual Name) for CPU5_BLK16_OTAR.
* To use register names with standard convension, please use CPU5_BLK16_OTAR.
*/
#define CPU5_OTAR16 (CPU5_BLK16_OTAR)

/** \brief FBD8, CPUx Overlay Mask Register 16 */
#define CPU5_BLK16_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFBD8u)
/** Alias (User Manual Name) for CPU5_BLK16_OMASK.
* To use register names with standard convension, please use CPU5_BLK16_OMASK.
*/
#define CPU5_OMASK16 (CPU5_BLK16_OMASK)

/** \brief FBDC, CPUx Redirected Address Base Register 17 */
#define CPU5_BLK17_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFBDCu)
/** Alias (User Manual Name) for CPU5_BLK17_RABR.
* To use register names with standard convension, please use CPU5_BLK17_RABR.
*/
#define CPU5_RABR17 (CPU5_BLK17_RABR)

/** \brief FBE0, CPUx Overlay Target Address Register 17 */
#define CPU5_BLK17_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFBE0u)
/** Alias (User Manual Name) for CPU5_BLK17_OTAR.
* To use register names with standard convension, please use CPU5_BLK17_OTAR.
*/
#define CPU5_OTAR17 (CPU5_BLK17_OTAR)

/** \brief FBE4, CPUx Overlay Mask Register 17 */
#define CPU5_BLK17_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFBE4u)
/** Alias (User Manual Name) for CPU5_BLK17_OMASK.
* To use register names with standard convension, please use CPU5_BLK17_OMASK.
*/
#define CPU5_OMASK17 (CPU5_BLK17_OMASK)

/** \brief FBE8, CPUx Redirected Address Base Register 18 */
#define CPU5_BLK18_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFBE8u)
/** Alias (User Manual Name) for CPU5_BLK18_RABR.
* To use register names with standard convension, please use CPU5_BLK18_RABR.
*/
#define CPU5_RABR18 (CPU5_BLK18_RABR)

/** \brief FBEC, CPUx Overlay Target Address Register 18 */
#define CPU5_BLK18_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFBECu)
/** Alias (User Manual Name) for CPU5_BLK18_OTAR.
* To use register names with standard convension, please use CPU5_BLK18_OTAR.
*/
#define CPU5_OTAR18 (CPU5_BLK18_OTAR)

/** \brief FBF0, CPUx Overlay Mask Register 18 */
#define CPU5_BLK18_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFBF0u)
/** Alias (User Manual Name) for CPU5_BLK18_OMASK.
* To use register names with standard convension, please use CPU5_BLK18_OMASK.
*/
#define CPU5_OMASK18 (CPU5_BLK18_OMASK)

/** \brief FBF4, CPUx Redirected Address Base Register 19 */
#define CPU5_BLK19_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFBF4u)
/** Alias (User Manual Name) for CPU5_BLK19_RABR.
* To use register names with standard convension, please use CPU5_BLK19_RABR.
*/
#define CPU5_RABR19 (CPU5_BLK19_RABR)

/** \brief FBF8, CPUx Overlay Target Address Register 19 */
#define CPU5_BLK19_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFBF8u)
/** Alias (User Manual Name) for CPU5_BLK19_OTAR.
* To use register names with standard convension, please use CPU5_BLK19_OTAR.
*/
#define CPU5_OTAR19 (CPU5_BLK19_OTAR)

/** \brief FBFC, CPUx Overlay Mask Register 19 */
#define CPU5_BLK19_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFBFCu)
/** Alias (User Manual Name) for CPU5_BLK19_OMASK.
* To use register names with standard convension, please use CPU5_BLK19_OMASK.
*/
#define CPU5_OMASK19 (CPU5_BLK19_OMASK)

/** \brief FC00, CPUx Redirected Address Base Register 20 */
#define CPU5_BLK20_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC00u)
/** Alias (User Manual Name) for CPU5_BLK20_RABR.
* To use register names with standard convension, please use CPU5_BLK20_RABR.
*/
#define CPU5_RABR20 (CPU5_BLK20_RABR)

/** \brief FC04, CPUx Overlay Target Address Register 20 */
#define CPU5_BLK20_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC04u)
/** Alias (User Manual Name) for CPU5_BLK20_OTAR.
* To use register names with standard convension, please use CPU5_BLK20_OTAR.
*/
#define CPU5_OTAR20 (CPU5_BLK20_OTAR)

/** \brief FC08, CPUx Overlay Mask Register 20 */
#define CPU5_BLK20_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC08u)
/** Alias (User Manual Name) for CPU5_BLK20_OMASK.
* To use register names with standard convension, please use CPU5_BLK20_OMASK.
*/
#define CPU5_OMASK20 (CPU5_BLK20_OMASK)

/** \brief FC0C, CPUx Redirected Address Base Register 21 */
#define CPU5_BLK21_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC0Cu)
/** Alias (User Manual Name) for CPU5_BLK21_RABR.
* To use register names with standard convension, please use CPU5_BLK21_RABR.
*/
#define CPU5_RABR21 (CPU5_BLK21_RABR)

/** \brief FC10, CPUx Overlay Target Address Register 21 */
#define CPU5_BLK21_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC10u)
/** Alias (User Manual Name) for CPU5_BLK21_OTAR.
* To use register names with standard convension, please use CPU5_BLK21_OTAR.
*/
#define CPU5_OTAR21 (CPU5_BLK21_OTAR)

/** \brief FC14, CPUx Overlay Mask Register 21 */
#define CPU5_BLK21_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC14u)
/** Alias (User Manual Name) for CPU5_BLK21_OMASK.
* To use register names with standard convension, please use CPU5_BLK21_OMASK.
*/
#define CPU5_OMASK21 (CPU5_BLK21_OMASK)

/** \brief FC18, CPUx Redirected Address Base Register 22 */
#define CPU5_BLK22_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC18u)
/** Alias (User Manual Name) for CPU5_BLK22_RABR.
* To use register names with standard convension, please use CPU5_BLK22_RABR.
*/
#define CPU5_RABR22 (CPU5_BLK22_RABR)

/** \brief FC1C, CPUx Overlay Target Address Register 22 */
#define CPU5_BLK22_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC1Cu)
/** Alias (User Manual Name) for CPU5_BLK22_OTAR.
* To use register names with standard convension, please use CPU5_BLK22_OTAR.
*/
#define CPU5_OTAR22 (CPU5_BLK22_OTAR)

/** \brief FC20, CPUx Overlay Mask Register 22 */
#define CPU5_BLK22_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC20u)
/** Alias (User Manual Name) for CPU5_BLK22_OMASK.
* To use register names with standard convension, please use CPU5_BLK22_OMASK.
*/
#define CPU5_OMASK22 (CPU5_BLK22_OMASK)

/** \brief FC24, CPUx Redirected Address Base Register 23 */
#define CPU5_BLK23_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC24u)
/** Alias (User Manual Name) for CPU5_BLK23_RABR.
* To use register names with standard convension, please use CPU5_BLK23_RABR.
*/
#define CPU5_RABR23 (CPU5_BLK23_RABR)

/** \brief FC28, CPUx Overlay Target Address Register 23 */
#define CPU5_BLK23_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC28u)
/** Alias (User Manual Name) for CPU5_BLK23_OTAR.
* To use register names with standard convension, please use CPU5_BLK23_OTAR.
*/
#define CPU5_OTAR23 (CPU5_BLK23_OTAR)

/** \brief FC2C, CPUx Overlay Mask Register 23 */
#define CPU5_BLK23_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC2Cu)
/** Alias (User Manual Name) for CPU5_BLK23_OMASK.
* To use register names with standard convension, please use CPU5_BLK23_OMASK.
*/
#define CPU5_OMASK23 (CPU5_BLK23_OMASK)

/** \brief FC30, CPUx Redirected Address Base Register 24 */
#define CPU5_BLK24_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC30u)
/** Alias (User Manual Name) for CPU5_BLK24_RABR.
* To use register names with standard convension, please use CPU5_BLK24_RABR.
*/
#define CPU5_RABR24 (CPU5_BLK24_RABR)

/** \brief FC34, CPUx Overlay Target Address Register 24 */
#define CPU5_BLK24_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC34u)
/** Alias (User Manual Name) for CPU5_BLK24_OTAR.
* To use register names with standard convension, please use CPU5_BLK24_OTAR.
*/
#define CPU5_OTAR24 (CPU5_BLK24_OTAR)

/** \brief FC38, CPUx Overlay Mask Register 24 */
#define CPU5_BLK24_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC38u)
/** Alias (User Manual Name) for CPU5_BLK24_OMASK.
* To use register names with standard convension, please use CPU5_BLK24_OMASK.
*/
#define CPU5_OMASK24 (CPU5_BLK24_OMASK)

