Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief FC3C, CPUx Redirected Address Base Register 25 */
#define CPU5_BLK25_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC3Cu)
/** Alias (User Manual Name) for CPU5_BLK25_RABR.
* To use register names with standard convension, please use CPU5_BLK25_RABR.
*/
#define CPU5_RABR25 (CPU5_BLK25_RABR)

/** \brief FC40, CPUx Overlay Target Address Register 25 */
#define CPU5_BLK25_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC40u)
/** Alias (User Manual Name) for CPU5_BLK25_OTAR.
* To use register names with standard convension, please use CPU5_BLK25_OTAR.
*/
#define CPU5_OTAR25 (CPU5_BLK25_OTAR)

/** \brief FC44, CPUx Overlay Mask Register 25 */
#define CPU5_BLK25_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC44u)
/** Alias (User Manual Name) for CPU5_BLK25_OMASK.
* To use register names with standard convension, please use CPU5_BLK25_OMASK.
*/
#define CPU5_OMASK25 (CPU5_BLK25_OMASK)

/** \brief FC48, CPUx Redirected Address Base Register 26 */
#define CPU5_BLK26_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC48u)
/** Alias (User Manual Name) for CPU5_BLK26_RABR.
* To use register names with standard convension, please use CPU5_BLK26_RABR.
*/
#define CPU5_RABR26 (CPU5_BLK26_RABR)

/** \brief FC4C, CPUx Overlay Target Address Register 26 */
#define CPU5_BLK26_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC4Cu)
/** Alias (User Manual Name) for CPU5_BLK26_OTAR.
* To use register names with standard convension, please use CPU5_BLK26_OTAR.
*/
#define CPU5_OTAR26 (CPU5_BLK26_OTAR)

/** \brief FC50, CPUx Overlay Mask Register 26 */
#define CPU5_BLK26_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC50u)
/** Alias (User Manual Name) for CPU5_BLK26_OMASK.
* To use register names with standard convension, please use CPU5_BLK26_OMASK.
*/
#define CPU5_OMASK26 (CPU5_BLK26_OMASK)

/** \brief FC54, CPUx Redirected Address Base Register 27 */
#define CPU5_BLK27_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC54u)
/** Alias (User Manual Name) for CPU5_BLK27_RABR.
* To use register names with standard convension, please use CPU5_BLK27_RABR.
*/
#define CPU5_RABR27 (CPU5_BLK27_RABR)

/** \brief FC58, CPUx Overlay Target Address Register 27 */
#define CPU5_BLK27_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC58u)
/** Alias (User Manual Name) for CPU5_BLK27_OTAR.
* To use register names with standard convension, please use CPU5_BLK27_OTAR.
*/
#define CPU5_OTAR27 (CPU5_BLK27_OTAR)

/** \brief FC5C, CPUx Overlay Mask Register 27 */
#define CPU5_BLK27_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC5Cu)
/** Alias (User Manual Name) for CPU5_BLK27_OMASK.
* To use register names with standard convension, please use CPU5_BLK27_OMASK.
*/
#define CPU5_OMASK27 (CPU5_BLK27_OMASK)

/** \brief FC60, CPUx Redirected Address Base Register 28 */
#define CPU5_BLK28_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC60u)
/** Alias (User Manual Name) for CPU5_BLK28_RABR.
* To use register names with standard convension, please use CPU5_BLK28_RABR.
*/
#define CPU5_RABR28 (CPU5_BLK28_RABR)

/** \brief FC64, CPUx Overlay Target Address Register 28 */
#define CPU5_BLK28_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC64u)
/** Alias (User Manual Name) for CPU5_BLK28_OTAR.
* To use register names with standard convension, please use CPU5_BLK28_OTAR.
*/
#define CPU5_OTAR28 (CPU5_BLK28_OTAR)

/** \brief FC68, CPUx Overlay Mask Register 28 */
#define CPU5_BLK28_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC68u)
/** Alias (User Manual Name) for CPU5_BLK28_OMASK.
* To use register names with standard convension, please use CPU5_BLK28_OMASK.
*/
#define CPU5_OMASK28 (CPU5_BLK28_OMASK)

/** \brief FC6C, CPUx Redirected Address Base Register 29 */
#define CPU5_BLK29_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC6Cu)
/** Alias (User Manual Name) for CPU5_BLK29_RABR.
* To use register names with standard convension, please use CPU5_BLK29_RABR.
*/
#define CPU5_RABR29 (CPU5_BLK29_RABR)

/** \brief FC70, CPUx Overlay Target Address Register 29 */
#define CPU5_BLK29_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC70u)
/** Alias (User Manual Name) for CPU5_BLK29_OTAR.
* To use register names with standard convension, please use CPU5_BLK29_OTAR.
*/
#define CPU5_OTAR29 (CPU5_BLK29_OTAR)

/** \brief FC74, CPUx Overlay Mask Register 29 */
#define CPU5_BLK29_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC74u)
/** Alias (User Manual Name) for CPU5_BLK29_OMASK.
* To use register names with standard convension, please use CPU5_BLK29_OMASK.
*/
#define CPU5_OMASK29 (CPU5_BLK29_OMASK)

/** \brief FC78, CPUx Redirected Address Base Register 30 */
#define CPU5_BLK30_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC78u)
/** Alias (User Manual Name) for CPU5_BLK30_RABR.
* To use register names with standard convension, please use CPU5_BLK30_RABR.
*/
#define CPU5_RABR30 (CPU5_BLK30_RABR)

/** \brief FC7C, CPUx Overlay Target Address Register 30 */
#define CPU5_BLK30_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC7Cu)
/** Alias (User Manual Name) for CPU5_BLK30_OTAR.
* To use register names with standard convension, please use CPU5_BLK30_OTAR.
*/
#define CPU5_OTAR30 (CPU5_BLK30_OTAR)

/** \brief FC80, CPUx Overlay Mask Register 30 */
#define CPU5_BLK30_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF88CFC80u)
/** Alias (User Manual Name) for CPU5_BLK30_OMASK.
* To use register names with standard convension, please use CPU5_BLK30_OMASK.
*/
#define CPU5_OMASK30 (CPU5_BLK30_OMASK)

/** \brief FC84, CPUx Redirected Address Base Register 31 */
#define CPU5_BLK31_RABR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_RABR*)0xF88CFC84u)
/** Alias (User Manual Name) for CPU5_BLK31_RABR.
* To use register names with standard convension, please use CPU5_BLK31_RABR.
*/
#define CPU5_RABR31 (CPU5_BLK31_RABR)

/** \brief FC88, CPUx Overlay Target Address Register 31 */
#define CPU5_BLK31_OTAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OTAR*)0xF88CFC88u)
/** Alias (User Manual Name) for CPU5_BLK31_OTAR.
* To use register names with standard convension, please use CPU5_BLK31_OTAR.
*/
#define CPU5_OTAR31 (CPU5_BLK31_OTAR)

