Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief C040, CPUx Data Protection Range 8, Lower Bound Register */
#define CPU5_DPR8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC040u)

/** \brief C044, CPUx Data Protection Range 8, Upper Bound Register */
#define CPU5_DPR8_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC044u)

/** \brief C048, CPUx Data Protection Range 9, Lower Bound Register */
#define CPU5_DPR9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC048u)

/** \brief C04C, CPUx Data Protection Range 9, Upper Bound Register */
#define CPU5_DPR9_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC04Cu)

/** \brief C050, CPUx Data Protection Range 10, Lower Bound Register */
#define CPU5_DPR10_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC050u)

/** \brief C054, CPUx Data Protection Range 10, Upper Bound Register */
#define CPU5_DPR10_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC054u)

/** \brief C058, CPUx Data Protection Range 11, Lower Bound Register */
#define CPU5_DPR11_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC058u)

/** \brief C05C, CPUx Data Protection Range 11, Upper Bound Register */
#define CPU5_DPR11_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC05Cu)

/** \brief C060, CPUx Data Protection Range 12, Lower Bound Register */
#define CPU5_DPR12_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC060u)

/** \brief C064, CPUx Data Protection Range 12, Upper Bound Register */
#define CPU5_DPR12_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC064u)

/** \brief C068, CPUx Data Protection Range 13, Lower Bound Register */
#define CPU5_DPR13_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC068u)

/** \brief C06C, CPUx Data Protection Range 13, Upper Bound Register */
#define CPU5_DPR13_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC06Cu)

/** \brief C070, CPUx Data Protection Range 14, Lower Bound Register */
#define CPU5_DPR14_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC070u)

/** \brief C074, CPUx Data Protection Range 14, Upper Bound Register */
#define CPU5_DPR14_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC074u)

/** \brief C078, CPUx Data Protection Range 15, Lower Bound Register */
#define CPU5_DPR15_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC078u)

/** \brief C07C, CPUx Data Protection Range 15, Upper Bound Register */
#define CPU5_DPR15_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC07Cu)

/** \brief C080, CPUx Data Protection Range 16, Lower Bound Register */
#define CPU5_DPR16_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC080u)

/** \brief C084, CPUx Data Protection Range 16, Upper Bound Register */
#define CPU5_DPR16_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC084u)

/** \brief C088, CPUx Data Protection Range 17, Lower Bound Register */
#define CPU5_DPR17_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF88DC088u)

/** \brief C08C, CPUx Data Protection Range 17, Upper Bound Register */
#define CPU5_DPR17_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF88DC08Cu)

/** \brief D000, CPUx Code Protection Range 0 Lower Bound Register */
#define CPU5_CPR0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD000u)

/** \brief D004, CPUx Code Protection Range 0 Upper Bound Register */
#define CPU5_CPR0_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD004u)

/** \brief D008, CPUx Code Protection Range 1 Lower Bound Register */
#define CPU5_CPR1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD008u)

/** \brief D00C, CPUx Code Protection Range 1 Upper Bound Register */
#define CPU5_CPR1_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD00Cu)

/** \brief D010, CPUx Code Protection Range 2 Lower Bound Register */
#define CPU5_CPR2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD010u)

/** \brief D014, CPUx Code Protection Range 2 Upper Bound Register */
#define CPU5_CPR2_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD014u)

/** \brief D018, CPUx Code Protection Range 3 Lower Bound Register */
#define CPU5_CPR3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD018u)

/** \brief D01C, CPUx Code Protection Range 3 Upper Bound Register */
#define CPU5_CPR3_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD01Cu)

/** \brief D020, CPUx Code Protection Range 4 Lower Bound Register */
#define CPU5_CPR4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD020u)

/** \brief D024, CPUx Code Protection Range 4 Upper Bound Register */
#define CPU5_CPR4_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD024u)

/** \brief D028, CPUx Code Protection Range 5 Lower Bound Register */
#define CPU5_CPR5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD028u)

/** \brief D02C, CPUx Code Protection Range 5 Upper Bound Register */
#define CPU5_CPR5_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD02Cu)

/** \brief D030, CPUx Code Protection Range 6 Lower Bound Register */
#define CPU5_CPR6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD030u)

/** \brief D034, CPUx Code Protection Range 6 Upper Bound Register */
#define CPU5_CPR6_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD034u)

/** \brief D038, CPUx Code Protection Range 7 Lower Bound Register */
#define CPU5_CPR7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD038u)

/** \brief D03C, CPUx Code Protection Range 7 Upper Bound Register */
#define CPU5_CPR7_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD03Cu)

/** \brief D040, CPUx Code Protection Range 8 Lower Bound Register */
#define CPU5_CPR8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD040u)

/** \brief D044, CPUx Code Protection Range 8 Upper Bound Register */
#define CPU5_CPR8_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD044u)

/** \brief D048, CPUx Code Protection Range 9 Lower Bound Register */
#define CPU5_CPR9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD048u)

/** \brief D04C, CPUx Code Protection Range 9 Upper Bound Register */
#define CPU5_CPR9_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD04Cu)

/** \brief E000, CPUx Code Protection Execute Enable Register Set 0 */
#define CPU5_CPXE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF88DE000u)

