Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_reg.h
/** \brief FF04, CPUx Data General Purpose Register 1 */
#define CPU5_D1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF04u)

/** \brief FF08, CPUx Data General Purpose Register 2 */
#define CPU5_D2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF08u)

/** \brief FF0C, CPUx Data General Purpose Register 3 */
#define CPU5_D3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF0Cu)

/** \brief FF10, CPUx Data General Purpose Register 4 */
#define CPU5_D4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF10u)

/** \brief FF14, CPUx Data General Purpose Register 5 */
#define CPU5_D5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF14u)

/** \brief FF18, CPUx Data General Purpose Register 6 */
#define CPU5_D6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF18u)

/** \brief FF1C, CPUx Data General Purpose Register 7 */
#define CPU5_D7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF1Cu)

/** \brief FF20, CPUx Data General Purpose Register 8 */
#define CPU5_D8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF20u)

/** \brief FF24, CPUx Data General Purpose Register 9 */
#define CPU5_D9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF24u)

/** \brief FF28, CPUx Data General Purpose Register 10 */
#define CPU5_D10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF28u)

/** \brief FF2C, CPUx Data General Purpose Register 11 */
#define CPU5_D11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF2Cu)

/** \brief FF30, CPUx Data General Purpose Register 12 */
#define CPU5_D12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF30u)

/** \brief FF34, CPUx Data General Purpose Register 13 */
#define CPU5_D13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF34u)

/** \brief FF38, CPUx Data General Purpose Register 14 */
#define CPU5_D14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF38u)

/** \brief FF3C, CPUx Data General Purpose Register 15 */
#define CPU5_D15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF88DFF3Cu)

/** \brief FF80, CPUx Address General Purpose Register 0 */
#define CPU5_A0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFF80u)

/** \brief FF84, CPUx Address General Purpose Register 1 */
#define CPU5_A1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFF84u)

/** \brief FF88, CPUx Address General Purpose Register 2 */
#define CPU5_A2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFF88u)

/** \brief FF8C, CPUx Address General Purpose Register 3 */
#define CPU5_A3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFF8Cu)

/** \brief FF90, CPUx Address General Purpose Register 4 */
#define CPU5_A4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFF90u)

/** \brief FF94, CPUx Address General Purpose Register 5 */
#define CPU5_A5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFF94u)

/** \brief FF98, CPUx Address General Purpose Register 6 */
#define CPU5_A6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFF98u)

/** \brief FF9C, CPUx Address General Purpose Register 7 */
#define CPU5_A7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFF9Cu)

/** \brief FFA0, CPUx Address General Purpose Register 8 */
#define CPU5_A8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFFA0u)

/** \brief FFA4, CPUx Address General Purpose Register 9 */
#define CPU5_A9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFFA4u)

/** \brief FFA8, CPUx Address General Purpose Register 10 */
#define CPU5_A10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFFA8u)

/** \brief FFAC, CPUx Address General Purpose Register 11 */
#define CPU5_A11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFFACu)

/** \brief FFB0, CPUx Address General Purpose Register 12 */
#define CPU5_A12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFFB0u)

/** \brief FFB4, CPUx Address General Purpose Register 13 */
#define CPU5_A13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFFB4u)

/** \brief FFB8, CPUx Address General Purpose Register 14 */
#define CPU5_A14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFFB8u)

/** \brief FFBC, CPUx Address General Purpose Register 15 */
#define CPU5_A15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF88DFFBCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXCPU_REG_H */
